---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DecalFailures.OutsideHost
source: html/7ffe20fc-907d-8e47-1afb-cae53c43d8ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DecalFailures.OutsideHost Property

Decal does not lie on host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OutsideHost { get; }
```